Tekla.Structures.Drawing.UnitAttributes
The UnitAttributes class handles attributes related to units and formatting of values.

Tekla.Structures.Drawing.UnitAttributes.Unit
Gets or sets the unit to use.

Tekla.Structures.Drawing.UnitAttributes.Format
Gets or sets the format to use.

Tekla.Structures.Drawing.UnitAttributes.Precision
Gets or sets the precision to use. For the future

Tekla.Structures.Drawing.UnitAttributes.#ctor
Creates a new default UnitAttributes attributes instance. The default values are Units.Automatic, FormatTypes.Automatic.

Tekla.Structures.Drawing.UnitAttributes.#ctor(Tekla.Structures.Drawing.Units,Tekla.Structures.Drawing.FormatTypes)
Creates a new UnitAttributes attributes instance with the given parameters.
unit: The units to use.
format: The format to use.

Tekla.Structures.Drawing.UnitAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.UnitAttributes.Clone
Clones the object.
Returns: A copy of the object.